---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableErrorInfo.Dispose
source: html/507ff64e-9654-42f7-33c0-8e0a1b6f66ea.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorInfo.Dispose Method

Releases all resources used by the FamilySizeTableErrorInfo

## Syntax (C#)
```csharp
public void Dispose()
```